// Игра "Змейка"

// Есть поле в клетку, по которой будет двигаться змея.
// На поле рандомно будет появляться один из трех видов фруктов: банан, яблоко, виноград.
// Когда змея съест определенный фрукт, она поменяет свой цвет под цвет этого фрукта
// (яблоко - красное, банан - желтое, виноград - фиолетовое).
// Также она с каждым поеданием фрукта будет удлиняться на одну ячейку.
// Если она удариться об стенку поля или об себя, то она умрет и игра начнётся занаво.
// Когда змея вырастет до определённого размера, то откроется дверь, в которую она должна зайти.
// Если она не сможет дойти, то игра начнётся заново.
